## Plan Result (test-global)




<pre><code>Plan: 0 to add, 41 to change, 0 to destroy.</code></pre>

* Update
  * module.landing_zone.azurerm_frontdoor.main
  * module.landing_zone.azurerm_frontdoor_firewall_policy.custom[&#34;adoption-web&#34;]
  * module.landing_zone.azurerm_frontdoor_firewall_policy.custom[&#34;bar&#34;]
  * module.landing_zone.azurerm_frontdoor_firewall_policy.custom[&#34;cft-api-mgmt&#34;]
  * module.landing_zone.azurerm_frontdoor_firewall_policy.custom[&#34;civil-citizen-ui&#34;]
  * module.landing_zone.azurerm_frontdoor_firewall_policy.custom[&#34;cmc&#34;]
  * module.landing_zone.azurerm_frontdoor_firewall_policy.custom[&#34;cmc-legal&#34;]
  * module.landing_zone.azurerm_frontdoor_firewall_policy.custom[&#34;div-da&#34;]
  * module.landing_zone.azurerm_frontdoor_firewall_policy.custom[&#34;div-dn&#34;]
  * module.landing_zone.azurerm_frontdoor_firewall_policy.custom[&#34;div-pfe&#34;]
  * module.landing_zone.azurerm_frontdoor_firewall_policy.custom[&#34;div-rfe&#34;]
  * module.landing_zone.azurerm_frontdoor_firewall_policy.custom[&#34;et-sya&#34;]
  * module.landing_zone.azurerm_frontdoor_firewall_policy.custom[&#34;fact&#34;]
  * module.landing_zone.azurerm_frontdoor_firewall_policy.custom[&#34;fact-admin&#34;]
  * module.landing_zone.azurerm_frontdoor_firewall_policy.custom[&#34;fees-register&#34;]
  * module.landing_zone.azurerm_frontdoor_firewall_policy.custom[&#34;gateway-ccd&#34;]
  * module.landing_zone.azurerm_frontdoor_firewall_policy.custom[&#34;hmcts-access&#34;]
  * module.landing_zone.azurerm_frontdoor_firewall_policy.custom[&#34;hmi-apim&#34;]
  * module.landing_zone.azurerm_frontdoor_firewall_policy.custom[&#34;ia-aip&#34;]
  * module.landing_zone.azurerm_frontdoor_firewall_policy.custom[&#34;idam-user-dashboard&#34;]
  * module.landing_zone.azurerm_frontdoor_firewall_policy.custom[&#34;idam-web-admin&#34;]
  * module.landing_zone.azurerm_frontdoor_firewall_policy.custom[&#34;idam-web-public&#34;]
  * module.landing_zone.azurerm_frontdoor_firewall_policy.custom[&#34;lau&#34;]
  * module.landing_zone.azurerm_frontdoor_firewall_policy.custom[&#34;nfdiv&#34;]
  * module.landing_zone.azurerm_frontdoor_firewall_policy.custom[&#34;nfdiv-apply&#34;]
  * module.landing_zone.azurerm_frontdoor_firewall_policy.custom[&#34;nfdiv-civil&#34;]
  * module.landing_zone.azurerm_frontdoor_firewall_policy.custom[&#34;paybubble&#34;]
  * module.landing_zone.azurerm_frontdoor_firewall_policy.custom[&#34;paymentoutcome-web&#34;]
  * module.landing_zone.azurerm_frontdoor_firewall_policy.custom[&#34;pcq&#34;]
  * module.landing_zone.azurerm_frontdoor_firewall_policy.custom[&#34;plum&#34;]
  * module.landing_zone.azurerm_frontdoor_firewall_policy.custom[&#34;privatelaw&#34;]
  * module.landing_zone.azurerm_frontdoor_firewall_policy.custom[&#34;probate&#34;]
  * module.landing_zone.azurerm_frontdoor_firewall_policy.custom[&#34;reformscan&#34;]
  * module.landing_zone.azurerm_frontdoor_firewall_policy.custom[&#34;return-case-doc-ccd&#34;]
  * module.landing_zone.azurerm_frontdoor_firewall_policy.custom[&#34;sscs-cor&#34;]
  * module.landing_zone.azurerm_frontdoor_firewall_policy.custom[&#34;sscs-tribunals&#34;]
  * module.landing_zone.azurerm_frontdoor_firewall_policy.custom[&#34;xui-approve-org&#34;]
  * module.landing_zone.azurerm_frontdoor_firewall_policy.custom[&#34;xui-manage-org&#34;]
  * module.landing_zone.azurerm_frontdoor_firewall_policy.custom[&#34;xui-register-org&#34;]
  * module.landing_zone.azurerm_frontdoor_firewall_policy.custom[&#34;xui-webapp&#34;]
  * module.landing_zone.azurerm_monitor_diagnostic_setting.frontdoor_diagnostics




<details><summary>Change Result (Click me)</summary>

```hcl

  # module.landing_zone.data.azurerm_monitor_diagnostic_categories.diagnostic_categories will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "azurerm_monitor_diagnostic_categories" "diagnostic_categories" {
      + id                  = (known after apply)
      + log_category_groups = (known after apply)
      + log_category_types  = (known after apply)
      + logs                = (known after apply)
      + metrics             = (known after apply)
      + resource_id         = "/subscriptions/8a07fdcd-6abd-48b3-ad88-ff737a4b9e3c/resourceGroups/lz-perftest-rg/providers/Microsoft.Network/frontDoors/hmcts-perftest"

      + timeouts {
          + read = (known after apply)
        }
    }

  # module.landing_zone.azurerm_frontdoor.main will be updated in-place
  ~ resource "azurerm_frontdoor" "main" {
        id                                   = "/subscriptions/8a07fdcd-6abd-48b3-ad88-ff737a4b9e3c/resourceGroups/lz-perftest-rg/providers/Microsoft.Network/frontDoors/hmcts-perftest"
        name                                 = "hmcts-perftest"
      ~ tags                                 = {
          + "autoShutdown" = "false"
            # (5 unchanged elements hidden)
        }
        # (11 unchanged attributes hidden)

        # (237 unchanged blocks hidden)
    }

  # module.landing_zone.azurerm_frontdoor_firewall_policy.custom["adoption-web"] will be updated in-place
  ~ resource "azurerm_frontdoor_firewall_policy" "custom" {
        id                                = "/subscriptions/8a07fdcd-6abd-48b3-ad88-ff737a4b9e3c/resourceGroups/lz-perftest-rg/providers/Microsoft.Network/frontDoorWebApplicationFirewallPolicies/adoptionwebperftest"
        name                              = "adoptionwebperftest"
      ~ tags                              = {
          + "autoShutdown" = "false"
            # (5 unchanged elements hidden)
        }
        # (6 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.landing_zone.azurerm_frontdoor_firewall_policy.custom["bar"] will be updated in-place
  ~ resource "azurerm_frontdoor_firewall_policy" "custom" {
        id                                = "/subscriptions/8a07fdcd-6abd-48b3-ad88-ff737a4b9e3c/resourceGroups/lz-perftest-rg/providers/Microsoft.Network/frontDoorWebApplicationFirewallPolicies/barperftest"
        name                              = "barperftest"
      ~ tags                              = {
          + "autoShutdown" = "false"
            # (5 unchanged elements hidden)
        }
        # (6 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.landing_zone.azurerm_frontdoor_firewall_policy.custom["cft-api-mgmt"] will be updated in-place
  ~ resource "azurerm_frontdoor_firewall_policy" "custom" {
        id                                = "/subscriptions/8a07fdcd-6abd-48b3-ad88-ff737a4b9e3c/resourceGroups/lz-perftest-rg/providers/Microsoft.Network/frontDoorWebApplicationFirewallPolicies/cftapimgmtperftest"
        name                              = "cftapimgmtperftest"
      ~ tags                              = {
          + "autoShutdown" = "false"
            # (5 unchanged elements hidden)
        }
        # (6 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.landing_zone.azurerm_frontdoor_firewall_policy.custom["civil-citizen-ui"] will be updated in-place
  ~ resource "azurerm_frontdoor_firewall_policy" "custom" {
        id                                = "/subscriptions/8a07fdcd-6abd-48b3-ad88-ff737a4b9e3c/resourceGroups/lz-perftest-rg/providers/Microsoft.Network/frontDoorWebApplicationFirewallPolicies/civilcitizenuiperftest"
        name                              = "civilcitizenuiperftest"
      ~ tags                              = {
          + "autoShutdown" = "false"
            # (5 unchanged elements hidden)
        }
        # (6 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.landing_zone.azurerm_frontdoor_firewall_policy.custom["cmc"] will be updated in-place
  ~ resource "azurerm_frontdoor_firewall_policy" "custom" {
        id                                = "/subscriptions/8a07fdcd-6abd-48b3-ad88-ff737a4b9e3c/resourceGroups/lz-perftest-rg/providers/Microsoft.Network/frontDoorWebApplicationFirewallPolicies/cmcperftest"
        name                              = "cmcperftest"
      ~ tags                              = {
          + "autoShutdown" = "false"
            # (5 unchanged elements hidden)
        }
        # (6 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.landing_zone.azurerm_frontdoor_firewall_policy.custom["cmc-legal"] will be updated in-place
  ~ resource "azurerm_frontdoor_firewall_policy" "custom" {
        id                                = "/subscriptions/8a07fdcd-6abd-48b3-ad88-ff737a4b9e3c/resourceGroups/lz-perftest-rg/providers/Microsoft.Network/frontDoorWebApplicationFirewallPolicies/cmclegalperftest"
        name                              = "cmclegalperftest"
      ~ tags                              = {
          + "autoShutdown" = "false"
            # (5 unchanged elements hidden)
        }
        # (6 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.landing_zone.azurerm_frontdoor_firewall_policy.custom["div-da"] will be updated in-place
  ~ resource "azurerm_frontdoor_firewall_policy" "custom" {
        id                                = "/subscriptions/8a07fdcd-6abd-48b3-ad88-ff737a4b9e3c/resourceGroups/lz-perftest-rg/providers/Microsoft.Network/frontDoorWebApplicationFirewallPolicies/divdaperftest"
        name                              = "divdaperftest"
      ~ tags                              = {
          + "autoShutdown" = "false"
            # (5 unchanged elements hidden)
        }
        # (6 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.landing_zone.azurerm_frontdoor_firewall_policy.custom["div-dn"] will be updated in-place
  ~ resource "azurerm_frontdoor_firewall_policy" "custom" {
        id                                = "/subscriptions/8a07fdcd-6abd-48b3-ad88-ff737a4b9e3c/resourceGroups/lz-perftest-rg/providers/Microsoft.Network/frontDoorWebApplicationFirewallPolicies/divdnperftest"
        name                              = "divdnperftest"
      ~ tags                              = {
          + "autoShutdown" = "false"
            # (5 unchanged elements hidden)
        }
        # (6 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.landing_zone.azurerm_frontdoor_firewall_policy.custom["div-pfe"] will be updated in-place
  ~ resource "azurerm_frontdoor_firewall_policy" "custom" {
        id                                = "/subscriptions/8a07fdcd-6abd-48b3-ad88-ff737a4b9e3c/resourceGroups/lz-perftest-rg/providers/Microsoft.Network/frontDoorWebApplicationFirewallPolicies/divpfeperftest"
        name                              = "divpfeperftest"
      ~ tags                              = {
          + "autoShutdown" = "false"
            # (5 unchanged elements hidden)
        }
        # (6 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.landing_zone.azurerm_frontdoor_firewall_policy.custom["div-rfe"] will be updated in-place
  ~ resource "azurerm_frontdoor_firewall_policy" "custom" {
        id                                = "/subscriptions/8a07fdcd-6abd-48b3-ad88-ff737a4b9e3c/resourceGroups/lz-perftest-rg/providers/Microsoft.Network/frontDoorWebApplicationFirewallPolicies/divrfeperftest"
        name                              = "divrfeperftest"
      ~ tags                              = {
          + "autoShutdown" = "false"
            # (5 unchanged elements hidden)
        }
        # (6 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.landing_zone.azurerm_frontdoor_firewall_policy.custom["et-sya"] will be updated in-place
  ~ resource "azurerm_frontdoor_firewall_policy" "custom" {
        id                                = "/subscriptions/8a07fdcd-6abd-48b3-ad88-ff737a4b9e3c/resourceGroups/lz-perftest-rg/providers/Microsoft.Network/frontDoorWebApplicationFirewallPolicies/etsyaperftest"
        name                              = "etsyaperftest"
      ~ tags                              = {
          + "autoShutdown" = "false"
            # (5 unchanged elements hidden)
        }
        # (6 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.landing_zone.azurerm_frontdoor_firewall_policy.custom["fact"] will be updated in-place
  ~ resource "azurerm_frontdoor_firewall_policy" "custom" {
        id                                = "/subscriptions/8a07fdcd-6abd-48b3-ad88-ff737a4b9e3c/resourceGroups/lz-perftest-rg/providers/Microsoft.Network/frontDoorWebApplicationFirewallPolicies/factperftest"
        name                              = "factperftest"
      ~ tags                              = {
          + "autoShutdown" = "false"
            # (5 unchanged elements hidden)
        }
        # (6 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.landing_zone.azurerm_frontdoor_firewall_policy.custom["fact-admin"] will be updated in-place
  ~ resource "azurerm_frontdoor_firewall_policy" "custom" {
        id                                = "/subscriptions/8a07fdcd-6abd-48b3-ad88-ff737a4b9e3c/resourceGroups/lz-perftest-rg/providers/Microsoft.Network/frontDoorWebApplicationFirewallPolicies/factadminperftest"
        name                              = "factadminperftest"
      ~ tags                              = {
          + "autoShutdown" = "false"
            # (5 unchanged elements hidden)
        }
        # (6 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.landing_zone.azurerm_frontdoor_firewall_policy.custom["fees-register"] will be updated in-place
  ~ resource "azurerm_frontdoor_firewall_policy" "custom" {
        id                                = "/subscriptions/8a07fdcd-6abd-48b3-ad88-ff737a4b9e3c/resourceGroups/lz-perftest-rg/providers/Microsoft.Network/frontDoorWebApplicationFirewallPolicies/feesregisterperftest"
        name                              = "feesregisterperftest"
      ~ tags                              = {
          + "autoShutdown" = "false"
            # (5 unchanged elements hidden)
        }
        # (6 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.landing_zone.azurerm_frontdoor_firewall_policy.custom["gateway-ccd"] will be updated in-place
  ~ resource "azurerm_frontdoor_firewall_policy" "custom" {
        id                                = "/subscriptions/8a07fdcd-6abd-48b3-ad88-ff737a4b9e3c/resourceGroups/lz-perftest-rg/providers/Microsoft.Network/frontDoorWebApplicationFirewallPolicies/gatewayccdperftest"
        name                              = "gatewayccdperftest"
      ~ tags                              = {
          + "autoShutdown" = "false"
            # (5 unchanged elements hidden)
        }
        # (6 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.landing_zone.azurerm_frontdoor_firewall_policy.custom["hmcts-access"] will be updated in-place
  ~ resource "azurerm_frontdoor_firewall_policy" "custom" {
        id                                = "/subscriptions/8a07fdcd-6abd-48b3-ad88-ff737a4b9e3c/resourceGroups/lz-perftest-rg/providers/Microsoft.Network/frontDoorWebApplicationFirewallPolicies/hmctsaccessperftest"
        name                              = "hmctsaccessperftest"
      ~ tags                              = {
          + "autoShutdown" = "false"
            # (5 unchanged elements hidden)
        }
        # (6 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.landing_zone.azurerm_frontdoor_firewall_policy.custom["hmi-apim"] will be updated in-place
  ~ resource "azurerm_frontdoor_firewall_policy" "custom" {
        id                                = "/subscriptions/8a07fdcd-6abd-48b3-ad88-ff737a4b9e3c/resourceGroups/lz-perftest-rg/providers/Microsoft.Network/frontDoorWebApplicationFirewallPolicies/hmiapimperftest"
        name                              = "hmiapimperftest"
      ~ tags                              = {
          + "autoShutdown" = "false"
            # (5 unchanged elements hidden)
        }
        # (6 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.landing_zone.azurerm_frontdoor_firewall_policy.custom["ia-aip"] will be updated in-place
  ~ resource "azurerm_frontdoor_firewall_policy" "custom" {
        id                                = "/subscriptions/8a07fdcd-6abd-48b3-ad88-ff737a4b9e3c/resourceGroups/lz-perftest-rg/providers/Microsoft.Network/frontDoorWebApplicationFirewallPolicies/iaaipperftest"
        name                              = "iaaipperftest"
      ~ tags                              = {
          + "autoShutdown" = "false"
            # (5 unchanged elements hidden)
        }
        # (6 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.landing_zone.azurerm_frontdoor_firewall_policy.custom["idam-user-dashboard"] will be updated in-place
  ~ resource "azurerm_frontdoor_firewall_policy" "custom" {
        id                                = "/subscriptions/8a07fdcd-6abd-48b3-ad88-ff737a4b9e3c/resourceGroups/lz-perftest-rg/providers/Microsoft.Network/frontDoorWebApplicationFirewallPolicies/idamuserdashboardperftest"
        name                              = "idamuserdashboardperftest"
      ~ tags                              = {
          + "autoShutdown" = "false"
            # (5 unchanged elements hidden)
        }
        # (6 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.landing_zone.azurerm_frontdoor_firewall_policy.custom["idam-web-admin"] will be updated in-place
  ~ resource "azurerm_frontdoor_firewall_policy" "custom" {
        id                                = "/subscriptions/8a07fdcd-6abd-48b3-ad88-ff737a4b9e3c/resourceGroups/lz-perftest-rg/providers/Microsoft.Network/frontDoorWebApplicationFirewallPolicies/idamwebadminperftest"
        name                              = "idamwebadminperftest"
      ~ tags                              = {
          + "autoShutdown" = "false"
            # (5 unchanged elements hidden)
        }
        # (6 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.landing_zone.azurerm_frontdoor_firewall_policy.custom["idam-web-public"] will be updated in-place
  ~ resource "azurerm_frontdoor_firewall_policy" "custom" {
        id                                = "/subscriptions/8a07fdcd-6abd-48b3-ad88-ff737a4b9e3c/resourceGroups/lz-perftest-rg/providers/Microsoft.Network/frontDoorWebApplicationFirewallPolicies/idamwebpublicperftest"
        name                              = "idamwebpublicperftest"
      ~ tags                              = {
          + "autoShutdown" = "false"
            # (5 unchanged elements hidden)
        }
        # (6 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.landing_zone.azurerm_frontdoor_firewall_policy.custom["lau"] will be updated in-place
  ~ resource "azurerm_frontdoor_firewall_policy" "custom" {
        id                                = "/subscriptions/8a07fdcd-6abd-48b3-ad88-ff737a4b9e3c/resourceGroups/lz-perftest-rg/providers/Microsoft.Network/frontDoorWebApplicationFirewallPolicies/lauperftest"
        name                              = "lauperftest"
      ~ tags                              = {
          + "autoShutdown" = "false"
            # (5 unchanged elements hidden)
        }
        # (6 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.landing_zone.azurerm_frontdoor_firewall_policy.custom["nfdiv"] will be updated in-place
  ~ resource "azurerm_frontdoor_firewall_policy" "custom" {
        id                                = "/subscriptions/8a07fdcd-6abd-48b3-ad88-ff737a4b9e3c/resourceGroups/lz-perftest-rg/providers/Microsoft.Network/frontDoorWebApplicationFirewallPolicies/nfdivperftest"
        name                              = "nfdivperftest"
      ~ tags                              = {
          + "autoShutdown" = "false"
            # (5 unchanged elements hidden)
        }
        # (6 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.landing_zone.azurerm_frontdoor_firewall_policy.custom["nfdiv-apply"] will be updated in-place
  ~ resource "azurerm_frontdoor_firewall_policy" "custom" {
        id                                = "/subscriptions/8a07fdcd-6abd-48b3-ad88-ff737a4b9e3c/resourceGroups/lz-perftest-rg/providers/Microsoft.Network/frontDoorWebApplicationFirewallPolicies/nfdivapplyperftest"
        name                              = "nfdivapplyperftest"
      ~ tags                              = {
          + "autoShutdown" = "false"
            # (5 unchanged elements hidden)
        }
        # (6 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.landing_zone.azurerm_frontdoor_firewall_policy.custom["nfdiv-civil"] will be updated in-place
  ~ resource "azurerm_frontdoor_firewall_policy" "custom" {
        id                                = "/subscriptions/8a07fdcd-6abd-48b3-ad88-ff737a4b9e3c/resourceGroups/lz-perftest-rg/providers/Microsoft.Network/frontDoorWebApplicationFirewallPolicies/nfdivcivilperftest"
        name                              = "nfdivcivilperftest"
      ~ tags                              = {
          + "autoShutdown" = "false"
            # (5 unchanged elements hidden)
        }
        # (6 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.landing_zone.azurerm_frontdoor_firewall_policy.custom["paybubble"] will be updated in-place
  ~ resource "azurerm_frontdoor_firewall_policy" "custom" {
        id                                = "/subscriptions/8a07fdcd-6abd-48b3-ad88-ff737a4b9e3c/resourceGroups/lz-perftest-rg/providers/Microsoft.Network/frontDoorWebApplicationFirewallPolicies/paybubbleperftest"
        name                              = "paybubbleperftest"
      ~ tags                              = {
          + "autoShutdown" = "false"
            # (5 unchanged elements hidden)
        }
        # (6 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.landing_zone.azurerm_frontdoor_firewall_policy.custom["paymentoutcome-web"] will be updated in-place
  ~ resource "azurerm_frontdoor_firewall_policy" "custom" {
        id                                = "/subscriptions/8a07fdcd-6abd-48b3-ad88-ff737a4b9e3c/resourceGroups/lz-perftest-rg/providers/Microsoft.Network/frontDoorWebApplicationFirewallPolicies/paymentoutcomewebperftest"
        name                              = "paymentoutcomewebperftest"
      ~ tags                              = {
          + "autoShutdown" = "false"
            # (5 unchanged elements hidden)
        }
        # (6 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.landing_zone.azurerm_frontdoor_firewall_policy.custom["pcq"] will be updated in-place
  ~ resource "azurerm_frontdoor_firewall_policy" "custom" {
        id                                = "/subscriptions/8a07fdcd-6abd-48b3-ad88-ff737a4b9e3c/resourceGroups/lz-perftest-rg/providers/Microsoft.Network/frontDoorWebApplicationFirewallPolicies/pcqperftest"
        name                              = "pcqperftest"
      ~ tags                              = {
          + "autoShutdown" = "false"
            # (5 unchanged elements hidden)
        }
        # (6 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.landing_zone.azurerm_frontdoor_firewall_policy.custom["plum"] will be updated in-place
  ~ resource "azurerm_frontdoor_firewall_policy" "custom" {
        id                                = "/subscriptions/8a07fdcd-6abd-48b3-ad88-ff737a4b9e3c/resourceGroups/lz-perftest-rg/providers/Microsoft.Network/frontDoorWebApplicationFirewallPolicies/plumperftest"
        name                              = "plumperftest"
      ~ tags                              = {
          + "autoShutdown" = "false"
            # (5 unchanged elements hidden)
        }
        # (6 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.landing_zone.azurerm_frontdoor_firewall_policy.custom["privatelaw"] will be updated in-place
  ~ resource "azurerm_frontdoor_firewall_policy" "custom" {
        id                                = "/subscriptions/8a07fdcd-6abd-48b3-ad88-ff737a4b9e3c/resourceGroups/lz-perftest-rg/providers/Microsoft.Network/frontDoorWebApplicationFirewallPolicies/privatelawperftest"
        name                              = "privatelawperftest"
      ~ tags                              = {
          + "autoShutdown" = "false"
            # (5 unchanged elements hidden)
        }
        # (6 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.landing_zone.azurerm_frontdoor_firewall_policy.custom["probate"] will be updated in-place
  ~ resource "azurerm_frontdoor_firewall_policy" "custom" {
        id                                = "/subscriptions/8a07fdcd-6abd-48b3-ad88-ff737a4b9e3c/resourceGroups/lz-perftest-rg/providers/Microsoft.Network/frontDoorWebApplicationFirewallPolicies/probateperftest"
        name                              = "probateperftest"
      ~ tags                              = {
          + "autoShutdown" = "false"
            # (5 unchanged elements hidden)
        }
        # (6 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.landing_zone.azurerm_frontdoor_firewall_policy.custom["reformscan"] will be updated in-place
  ~ resource "azurerm_frontdoor_firewall_policy" "custom" {
        id                                = "/subscriptions/8a07fdcd-6abd-48b3-ad88-ff737a4b9e3c/resourceGroups/lz-perftest-rg/providers/Microsoft.Network/frontDoorWebApplicationFirewallPolicies/reformscanperftest"
        name                              = "reformscanperftest"
      ~ tags                              = {
          + "autoShutdown" = "false"
            # (5 unchanged elements hidden)
        }
        # (6 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.landing_zone.azurerm_frontdoor_firewall_policy.custom["return-case-doc-ccd"] will be updated in-place
  ~ resource "azurerm_frontdoor_firewall_policy" "custom" {
        id                                = "/subscriptions/8a07fdcd-6abd-48b3-ad88-ff737a4b9e3c/resourceGroups/lz-perftest-rg/providers/Microsoft.Network/frontDoorWebApplicationFirewallPolicies/returncasedocccdperftest"
        name                              = "returncasedocccdperftest"
      ~ tags                              = {
          + "autoShutdown" = "false"
            # (5 unchanged elements hidden)
        }
        # (6 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.landing_zone.azurerm_frontdoor_firewall_policy.custom["sscs-cor"] will be updated in-place
  ~ resource "azurerm_frontdoor_firewall_policy" "custom" {
        id                                = "/subscriptions/8a07fdcd-6abd-48b3-ad88-ff737a4b9e3c/resourceGroups/lz-perftest-rg/providers/Microsoft.Network/frontDoorWebApplicationFirewallPolicies/sscscorperftest"
        name                              = "sscscorperftest"
      ~ tags                              = {
          + "autoShutdown" = "false"
            # (5 unchanged elements hidden)
        }
        # (6 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.landing_zone.azurerm_frontdoor_firewall_policy.custom["sscs-tribunals"] will be updated in-place
  ~ resource "azurerm_frontdoor_firewall_policy" "custom" {
        id                                = "/subscriptions/8a07fdcd-6abd-48b3-ad88-ff737a4b9e3c/resourceGroups/lz-perftest-rg/providers/Microsoft.Network/frontDoorWebApplicationFirewallPolicies/sscstribunalsperftest"
        name                              = "sscstribunalsperftest"
      ~ tags                              = {
          + "autoShutdown" = "false"
            # (5 unchanged elements hidden)
        }
        # (6 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.landing_zone.azurerm_frontdoor_firewall_policy.custom["xui-approve-org"] will be updated in-place
  ~ resource "azurerm_frontdoor_firewall_policy" "custom" {
        id                                = "/subscriptions/8a07fdcd-6abd-48b3-ad88-ff737a4b9e3c/resourceGroups/lz-perftest-rg/providers/Microsoft.Network/frontDoorWebApplicationFirewallPolicies/xuiapproveorgperftest"
        name                              = "xuiapproveorgperftest"
      ~ tags                              = {
          + "autoShutdown" = "false"
            # (5 unchanged elements hidden)
        }
        # (6 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.landing_zone.azurerm_frontdoor_firewall_policy.custom["xui-manage-org"] will be updated in-place
  ~ resource "azurerm_frontdoor_firewall_policy" "custom" {
        id                                = "/subscriptions/8a07fdcd-6abd-48b3-ad88-ff737a4b9e3c/resourceGroups/lz-perftest-rg/providers/Microsoft.Network/frontDoorWebApplicationFirewallPolicies/xuimanageorgperftest"
        name                              = "xuimanageorgperftest"
      ~ tags                              = {
          + "autoShutdown" = "false"
            # (5 unchanged elements hidden)
        }
        # (6 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.landing_zone.azurerm_frontdoor_firewall_policy.custom["xui-register-org"] will be updated in-place
  ~ resource "azurerm_frontdoor_firewall_policy" "custom" {
        id                                = "/subscriptions/8a07fdcd-6abd-48b3-ad88-ff737a4b9e3c/resourceGroups/lz-perftest-rg/providers/Microsoft.Network/frontDoorWebApplicationFirewallPolicies/xuiregisterorgperftest"
        name                              = "xuiregisterorgperftest"
      ~ tags                              = {
          + "autoShutdown" = "false"
            # (5 unchanged elements hidden)
        }
        # (6 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.landing_zone.azurerm_frontdoor_firewall_policy.custom["xui-webapp"] will be updated in-place
  ~ resource "azurerm_frontdoor_firewall_policy" "custom" {
        id                                = "/subscriptions/8a07fdcd-6abd-48b3-ad88-ff737a4b9e3c/resourceGroups/lz-perftest-rg/providers/Microsoft.Network/frontDoorWebApplicationFirewallPolicies/xuiwebappperftest"
        name                              = "xuiwebappperftest"
      ~ tags                              = {
          + "autoShutdown" = "false"
            # (5 unchanged elements hidden)
        }
        # (6 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.landing_zone.azurerm_monitor_diagnostic_setting.frontdoor_diagnostics will be updated in-place
  ~ resource "azurerm_monitor_diagnostic_setting" "frontdoor_diagnostics" {
        id                         = "/subscriptions/8a07fdcd-6abd-48b3-ad88-ff737a4b9e3c/resourceGroups/lz-perftest-rg/providers/Microsoft.Network/frontDoors/hmcts-perftest|fd-log-analytics"
        name                       = "fd-log-analytics"
        # (2 unchanged attributes hidden)

      - log {
          - category = "FrontdoorAccessLog" -> null
          - enabled  = true -> null

          - retention_policy {
              - days    = 0 -> null
              - enabled = true -> null
            }
        }
      - log {
          - category = "FrontdoorWebApplicationFirewallLog" -> null
          - enabled  = true -> null

          - retention_policy {
              - days    = 0 -> null
              - enabled = true -> null
            }
        }
      + log {
          + category       = (known after apply)
          + category_group = (known after apply)
          + enabled        = (known after apply)

          + retention_policy {
              + days    = (known after apply)
              + enabled = (known after apply)
            }
        }

      - metric {
          - category = "AllMetrics" -> null
          - enabled  = true -> null

          - retention_policy {
              - days    = 0 -> null
              - enabled = true -> null
            }
        }
      + metric {
          + category = (known after apply)
          + enabled  = (known after apply)

          + retention_policy {
              + days    = (known after apply)
              + enabled = (known after apply)
            }
        }
    }

Plan: 0 to add, 41 to change, 0 to destroy.
```

</details>





<!-- github-comment: {"Command":"plan","PRNumber":1388,"Program":"tfcmt","SHA1":"","Target":"test-global","Vars":{}} -->